Autodesk.Navisworks.Api.SavedViewpoint
A named saved viewpoint.

Autodesk.Navisworks.Api.SavedViewpoint.#ctor
Default constructor
Throws System.InvalidOperationException:
Exception when 'false'

Autodesk.Navisworks.Api.SavedViewpoint.#ctor(Autodesk.Navisworks.Api.Viewpoint)
Initialize SavedViewpoint with a Viewpoint
Throws System.ArgumentNullException:
Argument 'viewpoint' is null
Throws System.ArgumentException:
Argument 'viewpoint' has been Disposed

Autodesk.Navisworks.Api.SavedViewpoint.ContainsAppearanceOverrides
Determines if this SavedViewpoint contains material overrides.

Autodesk.Navisworks.Api.SavedViewpoint.ContainsVisibilityOverrides
Determines if this SavedViewpoint contains visibility overrides.

Autodesk.Navisworks.Api.SavedViewpoint.GetAppearanceOverrides
Gets material overrides for this SavedViewpoint.

Autodesk.Navisworks.Api.SavedViewpoint.GetVisibilityOverrides
Gets visibility overrides for this SavedViewpoint.

Autodesk.Navisworks.Api.SavedViewpoint.IsReadOnly
Gets a value indicating whether the object is read-only.

Autodesk.Navisworks.Api.SavedViewpoint.Viewpoint
Acesses the Viewpoint ascociated with this object.
Throws System.ObjectDisposedException:
Object has been Disposed